Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/death_related_benefits/widows_contrib_pension.html.txt.tmx
Source language: en
Languages: ga

source: Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension is a weekly payment to the husband, wife or civil partner of a deceased person
ga: Is eard atá sa Phinsean Baintrí, Baintrí Fir, nó Páirtnéara Shibialta Marthanaigh (Ranníocach), ná íocaíocht seachtainiúil don fhear céile, don bhean chéile nó do pháirtneir sibhialta de dhuine éagtha

source: This payment was formerly called the Widow's/Widower's (Contributory) Pension
ga: Tugadh an Pinsean Baintrí/Baintrí Fir (Ranníocach) ar an íocaíocht seo roimhe seo

source: Either you or your deceased spouse or civil partner must have enough social insurance contributions (PRSI)
ga: Ní mór duit nó do chéile/do pháirtnéir sibhialta éagtha dóthain ranníocaíochtaí árachais shóisialaigh (ÁSPC) a bheith aige/aici

source: To qualify you must, of course, be a widow, widower or surviving civil partner and you must not be cohabiting with another person
ga: Chun cáiliú ní mór duit a bheith i do bhaintreach, do bhaintreach fir nó do pháirtnéir sibhialta a mhaireann, agus ní féidir leat a bheith in aontíos le duine eile

source: If you are divorced and you would have been entitled to a Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension had you remained married, you keep your entitlement to the Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: Má tá tú colscartha agus dá mbeifeá i dteideal Phinsean Baintrí, Baintrí Fir, nó Páirtnéara Shibialta Marthanaigh(Ranníocach) dá bhfanfá pósta, coimeádann tú do theidlíocht Pinsean Baintrí, Baintrí Fir, nó Páirtnéara Shibialta Marthanaigh (Ranníocach) a fháil

source: If your civil partnership has been dissolved and you would have been entitled to a Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension had you remained in the civil partnership, you keep your entitlement to the Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: Má tá do chomhpháirtíocht sibhialta tar éis díscaoileadh agus dá mbeifeá i dteideal Pinsean Baintrí, Baintrí Fir, nó Páirtnéara Shibialta Marthanaigh (Ranníocach) a fháil dá bhfanfá sa pháirtíocht sibhialta, coimeádann tú do theidlíocht Pinsean Baintrí, Baintrí Fir, nó Páirtnéara Shibialta Marthanaigh (Ranníocach) a fháil

source: The pension is payable regardless of other income
ga: Íoctar an pinsean seo is cuma cén t-ioncam eile atá agat

source: Since 27 December 2013, new applicants for Widow's, Widow(er)'s Contributory Pension and Surviving Civil Partner's Contributory Pension need 260 paid PRSI contributions to qualify (previously 156 contributions were required)
ga: Ó 27 Nollaig 2013 ardóidh an líon ranníocaíochtaí íoctha riachtanacha ó 156 go 260 ranníocaíochtaí

source: You can read Frequently Asked Questions (FAQs) about this pension on welfare.ie
ga: Is féidir leat Ceisteanna Coitianta léamh faoi na hathruithe ar welfare.ie

source: You may automatically qualify for a Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension if your late spouse or civil partner was getting either a State Pension (Transition) or State Pension (Contributory), which included an increase for a dependent spouse or civil partner (or would have included an increase but for the fact that you were getting State Pension (Non-Contributory), Blind Pension or Carer's Allowance). There is no automatic qualification if your late spouse or civil partner was getting a mixed insurance pro-rata, EU/Bilateral Agreement pro-rata or Pre-53 pension. In all such cases you should apply for Widow's, Widower's or Surviving Civil Partner’s Contributory Pension in the normal way
ga: Béidh tú cáilithe le haghaidh Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) má bhí do chéile/pháirtnéir sibhialta básaithe ag fáil ceachtar den dá phinsean seo Pinsean Stáit (Idirthréimhse) nó Pinsin Stáit (Ranníocach), agus íocaíocht don chéile/pháirtnéir sibhialta cleithiúnach san áireamh (nó bheadh an íocaíocht sin i gceist ach amháin go raibh an céile/páirtnéir sibhialta ag fáil Pinsean Stáit (Neamh-ranníocach), Pinsean na nDall nó Liúntas Cúramóra)

source: If you do not automatically qualify for a Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension, then either you or your late spouse or civil partner must have a certain number of PRSI contributions
ga: Muna raibh do chás amhlaidh, ní mór duit ansin dóthain íocaíochtaí ÁSPC a bheith agat

source: Social insurance contributions (PRSI)
ga: Ranníocaíochtaí árachais sóisialta (ÁSPC)

source: To qualify for a Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension, either you or your late spouse or civil partner must have a certain number of PRSI contributions
ga: Le bheith ina theideal Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) ní mór duit nó do do chéile/páirtnéir sibhialta básaithe méid áirid ranníocaíochtaí ÁSPC a bheith agaibh

source: All the PRSI requirements must be met on one person's record - you may not combine the contributions of both spouses or civil partners
ga: Is ar íocaíochtaí ÁSPC duine amháin a dhéantar an méid áirid sin a chomhaireamh - ní féidir ranníocaíochtaí na beirte a chur le chéile leis an líon ceart a dhéanamh suas

source: All must have been made before the death of the spouse or civil partner
ga: Ní mór na ranníocaíochtaí ar fad a bheith déanta roimh bhás an chéile/páirtnéara sibhialta

source: Virtually all PRSI contributions count towards this pension, including contributions paid by public servants and the self-employed
ga: Comhraíonn nach mór chuile ranníocaíocht ÁSPC don phinsean seo, ranníocaíochtaí a dhéanann seirbhísigh poiblí agus daoine atá féin-fhostaithe fiú

source: Either you or your spouse or civil partner must have:
ga: Ní mór duit nó do chéile/páirtnéir sibhialta

source: • At least 260 paid contributions paid before the relevant date*
ga: • Ar a laghad 260 ranníocaíocht íoctha (íoctha go dtí an dáta a bhfuair do chéile/do pháirtnéir sibhialta bás nó roimh do 66ú lá breithe, cibé acu is luaithe)

source: • An average of 39 paid or credited contributions in either the 3 or 5 years before the death of the spouse or civil partner or before he or she reached pension age (66)
ga: • 39 ranníocaíocht sa mhéan sa 3 bhliain nó sa 5 bhliain roimh bás an chéile/páirtnéir sibhialta nó roimh dó/dí aois an phisin a bhaint amach (66)

source: • A yearly average of at least 24 paid or credited contributions from the year of first entry into insurance until the year of death or reaching pension age
ga: • Ar a laghad 24 ranníocaíocht bliantúil sa mheán a bheith agat ón gcéad bhliain a d'íoc tú árachas go dtí bliain an bháis nó an bhliain gur bhain tú aois an phinsin amach

source: If this average is used then an average of 24 will entitle you to a minimum pension, you will need an average of 48 per year to get the full pension. *The relevant date is the earliest of the following dates:
ga: Má bhaintear úsáid an an meán seo beidh tú i dteideal bunphinsin le meán de 24, teastóidh meán de 48 íocaíocht sa bhliain leis an bpinsean iomlán a fháil

source: However the yearly average condition must still be satisfied
ga: Ranníocaíochtaí íoctha i mball stáit eile den Aontais Eorpaigh

source: If you were previously insurably employed in a country covered by EU Regulations or in a country with which Ireland has a bilateral social security agreement and you have paid at least one full rate PRSI contribution in Ireland, you may combine your insurance record in that country with your Irish PRSI contributions to help you qualify for Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: Má bhí tú ar fostú inárachaithe roimhe i dtír atá clúdaithe faoi Rialacháin an AE nó i dtír lena bhfuil Comhaontú Déthaobhach Leasa Shóisialaigh ag Éire agus d’íoc tú ranníocaíocht amháin ráta iomlán ÁSPC ar a laghad in Éirinn, is féidir leat do thaifead árachais sa tír sin a chur le do chuid ranníocaíochtaí ÁSPC Éireannacha chun cabhrú leat cáiliú le haghaidh Phinsean Baintrí, Baintrí Fir, nó Páirtnéara Shibialta Marthanaigh (Ranníocach)

source: More information is available in our document about combining your social insurance contributions from abroad
ga: Tá tuilleadh eolais ar fáil inár ndoiciméad maidir le do ranníocaíochtaí árachais shóisialaigh ó thar lear a chur le chéile

source: Since this is a contributory pension, you may earn any amount of money from any other source and still remain entitled to this pension
ga: Ós rud é gur pinsean ranníocach atá i gceist anseo is féidir leat ioncam eile a bheith agat ó fhoinse ar bith eile agus fós a bheith i dteideal an phinsin seo

source: If it is your only source of income, you are unlikely to have to pay tax
ga: Muna bhfuil d'ioncam agat ach é ní dóigh go mbeidh aon dliteanas cánach ort

source: You cannot get a Widow's, Widower's or Surviving Civil Partner's Contributory Pension at the same time as a State Pension (Contributory). If you are entitled to both payments you will be paid whichever is the higher amount
ga: Ní féidir Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) a fháil ag an am céanna le Pinsin Stáit (Ranníocach)

source: You cannot get a training allowance at the same time as a Widow’s, Widower’s or Surviving Civil Partner’s Contributory Pension
ga: Má tá tú i dteideal dhá íocaíocht a fháil, íocfar leat an méid níos airde

source: Since 16 January 2012, you cannot get a Widow's, Widower's or Surviving Civil Partner's Contributory Pension in addition to full payment on a Community Employment Scheme
ga: Más mian leat an méid níos ísle a fháil, ba chóir duit dul i dteagmháil leis an Roinn Coimirce Sóisialaí (féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos)

source: The pension remains payable while you remain widowed or a surviving civil partner
ga: Is féidir an pinsean a fháil an fhad agus atá tú i do bhaintreach (fir nó mná) nó páirtnéir sibhialta marthanach

source: If you re-marry, enter a new civil partnership or start to cohabit, it is no longer payable
ga: Má athphósann tú, má dhéanann tú páirtnéireacht shibhialta nua nó má bhíonn tú i do chónaí le páirtí mar fhear agus bean, níl tú i dteideal an phinsin níos mó

source: You may get increases for qualified children with your pension - these remain payable while the child is aged under 18 and they may then be continued until age 22 if the child is in full-time education
ga: Is féidir méadú a fháil ar leanbh cáilithe mar chuid den phinsean - íoctar méadú an fhad agus atá páiste faoi 18 agus suas go sroicheann sé/sí 22 má tá sé/sí ag freastal ar oideachas lán-aimseartha

source: Other payments for widowed people and surviving civil partners
ga: Íocaíochtaí eile do dhaoine ar bhaintreach agus páirtnéirí sibhialta marthanacha

source: Under the Occupational Injuries Scheme, a widow's, widower's or surviving civil partner's pension may be payable if the death was due to an occupational injury or disease
ga: Faoin Scéim Gortaithe Ceirde is féidir Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh a íoc má bhásaigh an céile de bharr timpiste nó galair cheirde

source: People getting a Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension are eligible for the Household Benefits Package if they meet the usual conditions
ga: Daoine a bhfuil Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) dhá fháil acu tá siad i dteideal seirbhísí breise ar nós Liúntas Leictreachas má shásaíonn siad na gnáthchoinníollacha

source: If your spouse or partner was getting a Household Benefits Package when they died you can keep the package if you are aged 60 or over (even though you do not meet the usual age requirement)
ga: Daoine atá 60 nó ós a cionn, nuair a chailltear an céile/páirtnéir sibhialta atá ag fáil na seirbhísí in aisce coinníonn siad na seirbhísí sin fiú muna bhfuileadar ag sásamh an ghnáthriail aoise

source: │Contributions │(before 17 │ │ │
ga: Seo a leanas na rátaí íocaíochta i 2017

source: │Widow's, Widower's or Surviving Civil Partner's (Contributory) │
ga: │Phinsean Baintrí, Baintrí Fir, nó Páirtnéara Shibialta Marthanaigh│

source: │Pension (from March 2017) │
ga: │(Ranníocach) ó Márta 2017 │

source: │ │Aged under 66│Aged 66 or │Aged 80 or │
ga: │Ranníocaíochtaí │Faoi 66 │66 + │80 + │

source: │Increase for Qualified │€29.80 │ │Child (IQC) │ │
ga: │Méadú i leith Leanbh Cáilithe (MLC) │€29.80 │

source: A Living Alone Increase and/or an Increase for people aged 66 or over living on an island may also be paid
ga: D'fhéadfadh sé gur ráta laghduithe a bheadh le n-íoc leat muna bhfuil na ranníocaíochtaí ar fad a theastaíonn agat

source: To apply fill in a Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension form (pdf)
ga: Ba chóir duit an fhoirm iarratais Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) a íoslódáil agus a chomhlánú

source: A claim for Widow’s, Widower’s or Surviving Civil Partner’s Contributory Pension may be backdated for a maximum period of 6 months
ga: Is féidir éilimh dhéanacha ar Phinsean Ranníocach Baintrí, Baintrí Fir nó Pháirtnéara Shibhialta Mharthanaigh a shiardhátú go ceann 6 mhí ar a mhéad

source: Backdating of a late claim beyond 6 months will be considered in circumstances where you failed to claim because of:
ga: I gcásanna áirithe d'fhéadfaí éileamh a shiardhátú níos sia siar ná sé mhí:

source: • Incorrect information being supplied by the Department or
ga: • Faisnéis mhícheart á sholáthar ag an Roinn nó

source: • Your incapacity by illness or infirmity
ga: • Do éagumas tinneas nó easláinte

source: You can email the Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension section using the secure enquiry form
ga: Is féidir leat ríomhphost don Rannóg Phinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) a sheoladh tríd an fhoirm fhiosraithe a úsáid

source: If you wish to talk to someone face-to-face about your pension entitlements, you can visit your local Citizens Information Centre, Intreo Centre or Social Welfare Branch Office
ga: Más mian leat labhairt duine-le-duine faoi do theidlíochtaí, is féidir leat cuairt a thabhairt ar d'Ionad Faisnéise do Shaoránaigh áitiúil, Ionad Intreo nó d'Oifig Bhrainse Leasa Shóisialaigh
